Repository: Mohammed-Alamdhoun/fluentories
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar

source: Appointment Form
ar: نموذج حجز موعد

source: First Name
ar: الاسم الأول

source: Enter your first name
ar: أدخل اسمك الأول

source: Last Name
ar: اسم العائلة

source: Enter your last name
ar: أدخل اسم العائلة

source: Email
ar: البريد الإلكتروني

source: Enter your email address
ar: أدخل بريدك الإلكتروني

source: Phone Number
ar: رقم الهاتف

source: Enter your phone number
ar: أدخل رقم هاتفك

source: Appointment Date
ar: تاريخ الموعد

source: Appointment Time
ar: وقت الموعد

source: How did you hear about us?
ar: كيف سمعت عنا؟

source: Additional Notes
ar: ملاحظات إضافية

source: Additional notes
ar: ملاحظات إضافية

source: Book Appointment
ar: احجز الموعد

source: Menu
ar: القائمة

source: HOME
ar: الرئيسية

source: APPOINTMENT
ar: حجز موعد

source: REGISTER
ar: التسجيل

source: Language
ar: اللغة

source: About Fluentory
ar: عن Fluentory

source: Fluentory is a skills-focused language platform built to boost real-world confidence through practical, grammar-light learning. Founded in Amman in 2020, it offers personalized coaching, resume support, mock interviews, and more, all designed to prepare learners for global success. While we began with Business English, Fluentories is expanding to include other languages soon, because communication shouldn't have borders.
ar: فلونتوري هي منصة لغات تركز على المهارات، صُممت لتعزيز الثقة في الحياة الواقعية من خلال التعلم العملي الخفيف على القواعد. تأسست في عمّان عام 2020، وتقدم تدريباً شخصياً، دعم في إعداد السيرة الذاتية، مقابلات تجريبية، والمزيد، وكلها تهدف إلى إعداد المتعلمين للنجاح العالمي. بدأنا باللغة الإنجليزية للأعمال، ونعمل على التوسع لتشمل لغات أخرى قريباً، لأن التواصل لا يجب أن تكون له حدود.

source: What We Offer You
ar: ما الذي نقدمه لك

source: Business English Courses Build professional fluency for interviews, meetings, and global careers with a practical, grammar-light approach.
ar: دورات الإنجليزية للأعمال بناء طلاقة مهنية للمقابلات والاجتماعات والوظائف العالمية باستخدام نهج عملي وخفيف على القواعد.

source: Kids’ Public Speaking Programs Develop children's confidence, communication, and presentation skills through fun, interactive training.
ar: برامج التحدث أمام الجمهور للأطفال تطوير ثقة الأطفال ومهارات التواصل والعرض التقديمي من خلال تدريب ممتع وتفاعلي.

source: 1-on-1 Language Coaching Personalized sessions tailored to your specific goals—whether for career growth, education, or public speaking.
ar: تدريب لغوي فردي (واحد لواحد) جلسات شخصية مصممة خصيصاً لأهدافك سواء للنمو المهني أو التعليم أو التحدث أمام الجمهور.

source: Resume & Interview Preparation Sharpen your professional profile with expert CV feedback and mock interviews designed for real-world success.
ar: إعداد السيرة الذاتية والمقابلات تحسين ملفك المهني من خلال مراجعة احترافية للسيرة الذاتية ومقابلات تجريبية معدة للنجاح الواقعي.

source: Multilingual Courses (Coming Soon) Fluentories is expanding to offer courses in new languages—because effective communication goes beyond English.
ar: دورات متعددة اللغات (قريباً) تعمل فلونتوري على التوسع لتقديم دورات بلغات جديدة — لأن التواصل الفعال يتجاوز اللغة الإنجليزية.

source: What We Offer
ar: ما نقدمه

source: Vocabulary & Communication
ar: المفردات والتواصل

source: We provide you with a 500-word booklet full of workplace expressions and phrases, helping you speak naturally, improve your fluency, and communicate confidently in real-world professional environments.
ar: نقدم لك كتيباً يحتوي على 500 كلمة مليئة بالتعابير والعبارات المستخدمة في بيئة العمل، لمساعدتك على التحدث بطلاقة وبطبيعية والتواصل بثقة في بيئات العمل الواقعية.

source: Career-Focused Learning
ar: تعلم موجه نحو المسار المهني

source: You’ll receive curated recommendations for free, high-impact courses that align with your career goals — helping you strengthen both your technical and soft skills to stand out in the job market.
ar: ستتلقى توصيات منتقاة لدورات مجانية وفعالة تتماشى مع أهدافك المهنية — لمساعدتك على تعزيز مهاراتك التقنية والشخصية للتميز في سوق العمل.

source: Interview Preparation
ar: التحضير للمقابلات

source: We simulate real job interviews based on the company and position you’re targeting, then give you actionable feedback to improve your answers, body language, and confidence before the real thing.
ar: نحاكي مقابلات عمل حقيقية بناءً على الشركة والمنصب الذي تستهدفه، ثم نقدم لك ملاحظات عملية لتحسين إجاباتك، ولغة جسدك، وزيادة ثقتك قبل المقابلة الفعلية.

source: CV Optimization
ar: تحسين السيرة الذاتية

source: Your CV is your first impression — we help you structure it professionally, refine the language, highlight key strengths, and make sure it’s clear, polished, and completely free from mistakes.
ar: سيرتك الذاتية هي انطباعك الأول — نساعدك على تنظيمها بشكل احترافي، وتحسين لغتها، وإبراز نقاط قوتك الأساسية، وضمان أن تكون واضحة، مصقولة وخالية تماماً من الأخطاء.

source: Why We’re Different
ar: لماذا نحن مختلفون

source: At Fluentories, we don’t rely on recycled methods or outdated grammar drills. Our approach is modern, engaging, and tailored to your goals. By the end of our program, you will speak fluently and confidently — even with an American accent — and yes, without memorizing grammar rules.
ar: في فلونتوري، لا نعتمد على الأساليب المكررة أو تدريبات القواعد القديمة. نهجنا حديث وجذاب ومصمم وفقاً لأهدافك. بنهاية برنامجنا، ستتحدث بطلاقة وثقة — حتى بلكنة أمريكية — وبدون حفظ قواعد النحو.

source: We personalize every learner’s journey through one-on-one coaching, practical simulations, and constant feedback. Whether you're aiming for a job interview or international collaboration, we ensure your communication skills are career-ready.
ar: نخصص رحلة كل متعلم من خلال تدريب فردي، ومحاكاة عملية، وتغذية راجعة مستمرة. سواء كنت تستهدف مقابلة عمل أو تعاوناً دولياً، نضمن أن تكون مهاراتك في التواصل جاهزة للمسار المهني.

source: No more grammar memorization.
ar: لا مزيد من حفظ القواعد.

source: Just real, fluent results.
ar: فقط نتائج حقيقية وطلاقة في التحدث.

source: What Are You Waiting For?
ar: ماذا تنتظر؟

source: Join Fluentories today and start your journey to confident, career-ready English.
ar: انضم إلى فلونتوري اليوم وابدأ رحلتك نحو الإنجليزية الواثقة والمناسبة لمسارك المهني.

source: Register Now
ar: سجّل الآن

source: Registration Form
ar: نموذج التسجيل

source: Age
ar: العمر

source: Enter your age
ar: أدخل عمرك

source: Academic Level
ar: المستوى الأكاديمي

source: Availability Date
ar: تاريخ التوفر

source: Register
ar: تسجيل
